name: "activity_recognition"
layer {
  name: "sequence"
  type: "DummyData"
  top: "sequence"
  dummy_data_param {
    shape {
      dim: 5
      dim: 2
    }
    data_filler {
      type: "sequence"
      value: 3
    }
  }
}

