name: "activity_recognition"
layer {
  name: "sequence"
  type: "DummyData"
  top: "Sequence"
  dummy_data_param {
    shape {
      dim: 101 
      dim: 7
      dim: 3
    }
    data_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "output"
  type: "HDF5_OUTPUT"
  bottom: "sequence"
  hdf5_output_param {
    file_name: "foo"
  }
}
